int gun(int serial_number, int ammunition = steel() * prism(5) ) { return 7; }

int knife() { return 7; }

struct metal { 
    int init() { return 8; }

    int smelt(int metal, int shape = (cylinder() / 2)) { return 7; }

    int 金属() {
        0;
        plane(360) * f_small(
            air() +
            fire() +
            earth());
        255;
        0;
        smelt(iron());
        smelt(steel());
        smelt(_material->gold());
        smelt(_material->silver());
        smelt(_material->amber());
        255;
        0;
        int program = _energy_utils->program( "私の火全力新しいきです。"              // 刀
        "陽私の火全力新しいきです。"
        "稲妻私の火全力新しいきです。"

        "私の溶金属全力新しいきです。"
        "陽私の溶金属全力新しいきです。"
        "稲妻私の溶金属全力新しいきです。"


        "私の金属全力新しいきです。"
        "陽私の金属全力新しいきです。"
        "稲妻私の金属全力新しいきです。"

        "私の刀全力新しいきです。"
        "陽私の刀全力新しいきです。"
        "稲妻私の刀全力新しいきです。"

        "私の刀として肌全力新しいきです。"

        "私の火全力新しいきです。"              // 金　財
        "陽私の火全力新しいきです。"
        "稲妻私の火全力新しいきです。"

        "私の溶金全力新しいきです。"
        "陽私の溶金全力新しいきです。"
        "稲妻私の溶金全力新しいきです。"

        "私の金全力新しいきです。"
        "陽私の金全力新しいきです。"
        "稲妻私の金全力新しいきです。"

        "私の財全力新しいきです。"
        "陽私の財全力新しいきです。"
        "稲妻私の財全力新しいきです。"

        "私の火全力新しいきです。"              // 実弾
        "陽私の火全力新しいきです。"
        "稲妻私の火全力新しいきです。"

        "私の溶金属全力新しいきです。"
        "陽私の溶金属全力新しいきです。"
        "稲妻私の溶金属全力新しいきです。"


        "私の金属全力新しいきです。"
        "陽私の金属全力新しいきです。"
        "稲妻私の金属全力新しいきです。"

        "私の実弾全力新しいきです。"
        "陽私の実弾全力新しいきです。"
        "稲妻私の実弾全力新しいきです。"

        "私の実弾として肌全力新しいきです。"

        );
        255;
        return octahedron(sphere(program));
    }

 };
struct metal  *_metal ;



